
extract_symptom_dict = {
    "아토피":"아토피",
    "습진":"아토피",
    "발진":"발진", 
    "알러지":"알레르기", 
    "알레르기":"알레르기",
    "내성발톱":"내신성-발톱", 
    "백선":"백선",
    "무좀":"무좀",
    "건선":"건선",
    "피부암":"피부암",
    "포진":"포진",
    "링웜":"몸-도장부스럼-체부-백선",
    "Ringworm":"몸-도장부스럼-체부-백선",
    "접촉성 피부염":"접촉성 피부염",
    "모반":"모반",
    "두드러기":"두드러기",
    "루푸스":"루푸스",
    "지루성 피부염":"지루-피부염",
    "지루 피부염":"지루-피부염",
    "매독":"매독",
    "사마귀":"사마귀",
    "흑색증":"흑피증",
    "동상":"부동성-조직-손상",
    "냉상":"부동성-조직-손상",
    "동창":"부동성-조직-손상",
    "침족병":"부동성-조직-손상",
    "물집":"수포성-질환",
    "수포":"수포성-질환",
}

extract_disease_dict = {
    "아토피":"피부-질환/가려움증-및-피부염/아토피-피부염-습진",
    "습진":"피부-질환/가려움증-및-피부염/아토피-피부염-습진",
    "발진":"피부-질환/과민성-및-반응성-피부-질환/약물-발진", 
    "알레르기":"기본-정보-피부-질환/가려움증-및-피부염/두드러기", 
    "내신성-발톱":"피부-질환/손발톱-장애/내신성-발톱", 
    "백선":"기본-정보-피부-질환/피부-진균-감염/도장부스럼-백선-개요",
    "무좀":"기본-정보-피부-질환/피부-진균-감염/무좀",
    "건선":"피부-질환/건선-및-인설성-장애/건선",
    "피부암":"피부-질환/피부암/피부암-개요",
    "포진":"감염/포진-바이러스-감염/대상포진",
    "링웜":"피부-질환/피부-진균-감염/몸-도장부스럼-체부-백선",
    "접촉성 피부염":"피부-질환/가려움증-및-피부염/접촉성-피부염",
    "모반":"기본-정보-피부-질환/비암성-피부-성장/모반",
    "피부 감염":"피부-질환/피부-진균-감염/피부-진균-감염-개요",
    "바이러스 감염": "기본-정보-감염/포진-바이러스-감염/포진-바이러스-감염-개요",
    "모냥염":"피부-질환/피부-세균-감염/모낭염과-피부-농양",
    "두드러기":"피부-질환/가려움증-및-피부염/두드러기",
    "루푸스":"뼈,-관절,-근육-장애/결합-조직의-자가면역-질환/전신성-홍반루푸스-sle",
    "지루-피부염":"피부-질환/가려움증-및-피부염/지루-피부염",
    "매독":"감염/성병-std/매독",
    "사마귀":"피부-질환/바이러스성-피부-감염/사마귀",
    "흑피증":"피부-질환/색소-장애/흑피증",
    "부동성-조직-손상":"기본-정보-부상-및-중독/한랭-손상/부동성-조직-손상",
    "수포성-질환":"피부-질환/수포성-질환/수포성-질환-개요"
}

def extract_symptom(llm_content:str):
    return_item_list = list()
    for extract_str,extract_item in extract_symptom_dict.items():
        if extract_str in llm_content:
            return_item_list.append(extract_item)
    return return_item_list

def extract_disease(llm_content:str):
    return_item_list = list()
    for extract_str,extract_item in extract_disease_dict.items():    
        if extract_str in llm_content:
            return_item_list.append(extract_item)
    return return_item_list